adamkondraciuk/nrfx/mdk/nrf54h20_engb_application.svd
                    <msb>26</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel group 26 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel group 26 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_27</name>
                    <description>Channel group number</description>
                    <lsb>27</lsb>
                    <msb>27</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel group 27 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel group 27 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_28</name>
                    <description>Channel group number</description>
                    <lsb>28</lsb>
                    <msb>28</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel group 28 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel group 28 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_29</name>
                    <description>Channel group number</description>
                    <lsb>29</lsb>
                    <msb>29</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel group 29 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel group 29 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_30</name>
                    <description>Channel group number</description>
                    <lsb>30</lsb>
                    <msb>30</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel group 30 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel group 30 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CHG_31</name>
                    <description>Channel group number</description>
                    <lsb>31</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The channel group 31 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The channel group 31 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
        <cluster>
          <name>GRTC</name>
          <description>Unspecified</description>
          <headerStructName>UICR_GRTC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x660</addressOffset>
          <cluster>
            <name>CC</name>
            <description>Unspecified</description>
            <headerStructName>UICR_GRTC_CC</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>OWN</name>
              <description>Request ownership of the CCs of GRTCGRTC</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CC_0</name>
                  <description>Capture/compare register number</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 0</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 0</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_1</name>
                  <description>Capture/compare register number</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 1</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 1</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_2</name>
                  <description>Capture/compare register number</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 2</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 2</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_3</name>
                  <description>Capture/compare register number</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 3</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 3</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_4</name>
                  <description>Capture/compare register number</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 4</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 4</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_5</name>
                  <description>Capture/compare register number</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 5</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 5</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_6</name>
                  <description>Capture/compare register number</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 6</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 6</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_7</name>
                  <description>Capture/compare register number</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 7</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 7</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_8</name>
                  <description>Capture/compare register number</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 8</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 8</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_9</name>
                  <description>Capture/compare register number</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 9</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 9</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_10</name>
                  <description>Capture/compare register number</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 10</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 10</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_11</name>
                  <description>Capture/compare register number</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 11</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 11</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_12</name>
                  <description>Capture/compare register number</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 12</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 12</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_13</name>
                  <description>Capture/compare register number</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 13</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 13</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_14</name>
                  <description>Capture/compare register number</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 14</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 14</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_15</name>
                  <description>Capture/compare register number</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotOwn</name>
                      <description>Do not own the CC register 15</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Own</name>
                      <description>Own the CC register 15</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
