adamkondraciuk/nrfx/mdk/nrf54h20_engb_application.svd
        <cluster>
          <name>LFOSC</name>
          <description>Unspecified</description>
          <headerStructName>BICR_LFOSC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x018</addressOffset>
          <register>
            <name>LFXOCONFIG</name>
            <description>LFXO configuration.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACCURACY</name>
                <description>LFXO crystal or external signal accuracy.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The accuracy is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>500ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 500 ppm.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>250ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 250 ppm.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>150ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 150 ppm.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 100 ppm.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>75ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 75 ppm.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>50ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 50 ppm.</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>30ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 30 ppm.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20ppm</name>
                    <description>LFXO crystal or external signal has an accuracy of 20 ppm.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>LFXO mode. LFXO will not start unless MODE is configured. Setting this field to anyting but Unconfigured will be used as the indication that the selected source is available as input to the LFXO.</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The mode is unconfigured.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal</name>
                    <description>LFXO in external crystal oscillator mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSine</name>
                    <description>LFXO in external sine wave mode.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSquare</name>
                    <description>LFXO in external square wave mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>LFXO is not to be used.</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOADCAP</name>
                <description>Built-in load capacitors selection in 1 pF steps. Max. value 25 pF.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The built-in load capacitors is unconfigured. LFXO will not start unless LOADCAP is configured.</description>
                    <value>0xFF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Do not use the built-in load capacitors, only external capacitors will be used.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIME</name>
                <description>LFXO startup time in ms.</description>
                <lsb>16</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Startup time has not been configured.</description>
                    <value>0xFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFXOCAL</name>
            <description>LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit, load capacitance, or crystal swap.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFXOCAL</name>
                <description>LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit, load capacitance, or crystal swap.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Calibrate</name>
                    <description>Calibrate the LFXO at startup.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LFRCAUTOCALCONFIG</name>
            <description>LFRC autocalibration configuration.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TEMPINTERVAL</name>
                <description>Temperature measurement interval in 0.25 s steps.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>TEMPDELTA</name>
                <description>Temperature delta that should trigger a calibration in 0.25 degrees steps.</description>
                <lsb>8</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>INTERVALMAXNO</name>
                <description>Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature changes.</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>LFRC.AUTOCALCONFIG register enable.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>LFRC.AUTOCALCONFIG register has been configured and can be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>LFRC.AUTOCALCONFIG register has not been configured and cannot be used.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>HFXO</name>
          <description>Unspecified</description>
          <headerStructName>BICR_HFXO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x024</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>HFXO configuration.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>HFXO mode.</description>
                <lsb>8</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The mode is unconfigured.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Crystal</name>
                    <description>HFXO in external crystal oscillator mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExtSquare</name>
                    <description>HFXO in external square wave mode.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOADCAP</name>
                <description>Built-in load capacitors selection in 0.25 pF steps. Max. value 25.75 pF.</description>
                <lsb>12</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>The built-in load capacitors is unconfigured. HFXO will not start unless LOADCAP is configured.</description>
                    <value>0xFF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Do not use the built-in load capacitors, only external capacitors will be used.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTUPTIME</name>
            <description>HFXO startup time in us.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIME</name>
                <description>HFXO startup time in us.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Startup time has not been configured.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TAMPC</name>
          <description>Unspecified</description>
          <headerStructName>BICR_TAMPC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x034</addressOffset>
          <register>
            <name>TAMPERSWITCH</name>
            <description>Configuration for external tamper switch detector.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TAMPERSWITCH</name>
                <description>Tamper switch enable.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Tamper switch is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Tamper switch is enabled. Any value but 0xF is to be considered Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ACTIVESHIELD</name>
            <description>Configuration for active shield channels.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHEN_0</name>
                <description>Active shield enable for channel 0.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 0 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 0 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_1</name>
                <description>Active shield enable for channel 1.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 1 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 1 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_2</name>
                <description>Active shield enable for channel 2.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 2 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 2 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHEN_3</name>
                <description>Active shield enable for channel 3.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Active shield channel 3 is disabled.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Active shield channel 3 is enabled. Any value but 0xF is to be considered Enabled. If any channel is Enabled, the feature should be Enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>MISPROT</name>
          <description>Unspecified</description>
          <headerStructName>BICR_MISPROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x03C</addressOffset>
          <register>
            <name>POWERCONFIG</name>
            <description>Misconfiguration report for POWER.CONFIG register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>POWERCONFIG</name>
                <description>Misconfiguration report configuration for POWER.CONFIG register.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Correct</name>
                    <description>POWER.CONFIG register does not have an invalid field.</description>
                    <value>0x471B4B2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Incorrect</name>
                    <description>POWER.CONFIG register has at least an invalid field. POWER.CONFIG register is not used and should be corrected.</description>
                    <value>0xAA95E6D8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IOPORTPOWER</name>
            <description>Misconfiguration report for IOPORT.POWER0 and IOPORT.POWER1 registers.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IOPORTPOWER</name>
                <description>Misconfiguration report configuration for IOPORT.POWER0 and IOPORT.POWER1 registers.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Correct</name>
                    <description>IOPORT.POWER0 and IOPORT.POWER1 registers do not have an invalid field.</description>
                    <value>0x471B4B2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Incorrect</name>
                    <description>IOPORT.POWER0 and/or IOPORT.POWER1 registers have at least an invalid field. Invalid field is not used and should be corrected.</description>
                    <value>0xAA95E6D8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>IOPORTDRIVECTRL</name>
            <description>Misconfiguration report for IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 registers.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IOPORTDRIVECTRL0</name>
                <description>Misconfiguration report for IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 registers.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Correct</name>
                    <description>IOPORT.DRIVECTRL0 and IOPORT.DRIVECTRL1 register does not have an invalid field.</description>
                    <value>0x471B4B2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Incorrect</name>
                    <description>IOPORT.DRIVECTRL0 and/or and IOPORT.DRIVECTRL1 registers have at least an invalid field. Invalid field is not used and should be corrected.</description>
                    <value>0xAA95E6D8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
