adamkondraciuk/nrfx/mdk/nrf54h20_engb_application.svd
                <register>
                  <name>HSILIM</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.HSILIM</description>
                  <addressOffset>0x24</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ICMP</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.ICMP</description>
                  <addressOffset>0x28</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VGND</name>
                  <description>Trim value for SYSCTRL.VREGMAIN.TRIM.VGND</description>
                  <addressOffset>0x2C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>CONFIG</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMAIN_CONFIG</headerStructName>
                <access>read-write</access>
                <addressOffset>0x30</addressOffset>
                <register>
                  <name>CFGCH1</name>
                  <description>Config value for SYSCTRL.VREGMAIN.CONFIG.CFGCH1</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Config value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>MODE</name>
                <description>Config value for SYSCTRL.VREGMAIN.MODE</description>
                <addressOffset>0x34</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Config value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>VREGMRAM130</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGMRAM130</headerStructName>
              <access>read-write</access>
              <addressOffset>0x104</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMRAM130_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VBG</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.TRIM.VBG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIAS</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.TRIM.BIAS</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VPR</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.TRIM.VPR</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VREF</name>
                  <description>Trim value for SYSCTRL.VREGMRAM130.TRIM.VREF</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGMRAM131</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGMRAM131</headerStructName>
              <access>read-write</access>
              <addressOffset>0x114</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGMRAM131_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>VBG</name>
                  <description>Trim value for SYSCTRL.VREGMRAM131.TRIM.VBG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIAS</name>
                  <description>Trim value for SYSCTRL.VREGMRAM131.TRIM.BIAS</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VPR</name>
                  <description>Trim value for SYSCTRL.VREGMRAM131.TRIM.VPR</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VREF</name>
                  <description>Trim value for SYSCTRL.VREGMRAM131.TRIM.VREF</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGVS0V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGVS0V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0x124</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGVS0V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>IREF</name>
                  <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.IREF</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HIGHPOWER</name>
                  <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.HIGHPOWER</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>LOWPOWER</name>
                  <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.LOWPOWER</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>ULPR</name>
                  <description>Trim value for SYSCTRL.VREGVS0V8.TRIM.ULPR</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VREGUSB</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VREGUSB</headerStructName>
              <access>read-write</access>
              <addressOffset>0x134</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VREGUSB_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>TRIMVDD</name>
                  <description>Trim value for SYSCTRL.VREGUSB.TRIM.TRIMVDD</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TRIMIBP</name>
                  <description>Trim value for SYSCTRL.VREGUSB.TRIM.TRIMIBP</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TRIM0V8</name>
                  <description>Trim value for SYSCTRL.VREGUSB.TRIM.TRIM0V8</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TRIM3V3</name>
                  <description>Trim value for SYSCTRL.VREGUSB.TRIM.TRIM3V3</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VDETAO0V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VDETAO0V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0x144</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VDETAO0V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>BROWNOUT</name>
                  <description>Trim value for SYSCTRL.VDETAO0V8.TRIM.BROWNOUT</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PWRGOOD</name>
                  <description>Trim value for SYSCTRL.VDETAO0V8.TRIM.PWRGOOD</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>CONFIG</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VDETAO0V8_CONFIG</headerStructName>
                <access>read-write</access>
                <addressOffset>0x8</addressOffset>
                <register>
                  <name>BROWNOUTHP</name>
                  <description>Config value for SYSCTRL.VDETAO0V8.CONFIG.BROWNOUTHP</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Config value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VDETAO1V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VDETAO1V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0x150</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VDETAO1V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>BROWNOUTLVLHIGH</name>
                  <description>Trim value for SYSCTRL.VDETAO1V8.TRIM.BROWNOUTLVLHIGH</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BROWNOUTLVLLOW</name>
                  <description>Trim value for SYSCTRL.VDETAO1V8.TRIM.BROWNOUTLVLLOW</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>VDETVS0V8</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VDETVS0V8</headerStructName>
              <access>read-write</access>
              <addressOffset>0x158</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VDETVS0V8_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>BROWNOUT</name>
                  <description>Trim value for SYSCTRL.VDETVS0V8.TRIM.BROWNOUT</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PWRGOOD</name>
                  <description>Trim value for SYSCTRL.VDETVS0V8.TRIM.PWRGOOD</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
