adamkondraciuk/nrfx/mdk/nrf54h20_engb_application.svd
          <register>
            <name>REPAIR6</name>
            <description>SRAM repair register 6</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GDRAMCTRL0012</name>
                <description>GD RamController00 Ram 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDRAMCTRL0011</name>
                <description>GD RamController00 Ram 11</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDRAMCTRL0010</name>
                <description>GD RamController00 Ram 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDRAMCTRL0000</name>
                <description>GD RamController00 Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR7</name>
            <description>SRAM repair register 7</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GDCACHERAM07</name>
                <description>GD Cache Data Ram 7</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDCACHERAM06</name>
                <description>GD Cache Data Ram 6</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDCACHERAM05</name>
                <description>GD Cache Data Ram 5</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDCACHERAM04</name>
                <description>GD Cache Data Ram 4</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>REPAIR8</name>
            <description>SRAM repair register 8</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>GDCACHERAM03</name>
                <description>GD Cache Data Ram 3</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>GDCACHERAM02</name>
                <description>GD Cache Data Ram 2</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>GDCACHERAM01</name>
                <description>GD Cache Data Ram 1</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>GDCACHERAM00</name>
                <description>GD Cache Data Ram 0</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CRC32</name>
          <description>CRC32 value for FICR (except this word)</description>
          <addressOffset>0x7FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>CRC32 value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCACHEDATA_S</name>
      <description>CACHEDATA</description>
      <baseAddress>0x22F00000</baseAddress>
      <headerStructName>DCACHEDATA</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DCACHEDATA</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>256</dim>
          <dimIncrement>0x040</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCACHEDATA_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>WAY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>DCACHEDATA_SET_WAY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <cluster>
              <dim>8</dim>
              <dimIncrement>0x004</dimIncrement>
              <name>DU[%s]</name>
              <description>Unspecified</description>
              <headerStructName>DCACHEDATA_SET_WAY_DU</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <register>
                <dim>0x1</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DATA[%s]</name>
                <description>Description collection: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o].</description>
                <addressOffset>0x0</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>Data</name>
                    <description>Data</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <access>read-only</access>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
